
Процедура ЗаполнитьСписокПрав() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	НаборРолей = Метаданные.Роли;
	
	СписокПрав.Очистить();
	
	Для Каждого Роль Из НаборРолей Цикл
		СтрокаРоли = СписокПрав.Добавить();
		СтрокаРоли.ИмяРоли = Роль.Имя;
		СтрокаРоли.ПредставлениеРоли = Роль.Синоним;
		СтрокаРоли.Включено = Пользователь.Роли.Содержит(Роль);
	КонецЦикла;
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
		Пользователь.ПолноеИмя = ПолноеИмя;		
	КонецЕсли;
	
	Пользователь.Роли.Очистить();
	
	СписокРолей = СписокПрав.НайтиСтроки( Новый Структура(1+"Включено", Истина) );
	
	Для Каждого Роль Из СписокРолей Цикл
		Пользователь.Роли.Добавить( Метаданные.Роли.Найти(Роль.ИмяРоли) );
	КонецЦикла;
	
	Пользователь.Записать();
	
КонецПроцедуры
